Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/mental_health/mental_health_professionals.html.txt.tmx
Source language: en
Languages: ga

source: Mental health services use a multidisciplinary approach, where a number of professionals offer their particular skills in a co-ordinated and complementary way
ga: Glacann seirbhísí meabhairshláinte le cur chuige ildisciplíneach, áit a gcuireann gairmithe de chineálacha éagsúla a sainscileanna féin ar fáil ar bhealach comhordaithe comhlántach

source: Your GP is often the first person you will seek help from
ga: Go minic, is é an dochtúir ginearálta an chéad duine a dtéann daoine i dteagmháil leis agus iad ar lorg cabhrach

source: He/she will assess the problem and may either provide medication and monitor your condition or may refer you to a specialist, for example, psychiatrist, psychologist or counsellor, if necessary
ga: Déanfaidh sé/sí measúnú ar an bhfadhb agus d’fhéadfadh go gcinnfeadh sé/sí cógas a chur ar fáil agus monatóireacht a dhéanamh ar do riocht nó d’fhéadfadh go n-atreoródh sé/sí thú chuig speisialtóir, e.g., síciatraí, síceolaí nó comhairleoir, más gá

source: Your GP may be able to recommend a support group for the particular problem
ga: D’fhéadfadh go mbeadh do dhochtúir teaghlaigh in ann grúpa tacaíochta a mholadh duit i gcomhair na faidhbe atá i gceist

source: Where others are involved in the patient's care (for example, psychiatrist, social worker, family members, etc.) your GP may liaise with them in order to provide you with the best overall care
ga: Sa chás go bhfuil daoine eile páirteach i gcúram an othair (e.g. síciatraí, oibrí sóisialta, baill teaghlaigh, etc.), d’fhéadfadh go rachadh do dhochtúir ginearálta i gcomhairle leo ar mhaithe leis an gcúram is fearr a chur ar fáil

source: A psychiatrist is a medical doctor that specialises in mental health
ga: Is dochtúir leighis a dhéanann speisialtacht de mheabhairshláinte is ea síciatraí

source: Psychiatrists are responsible for the medical care of psychiatric patients (medication, physical symptoms, etc.) and are also involved in counselling
ga: Tá síciatraithe freagrach as cúram leighis othar síciatrach (cógas, siomtóim fhisiciúla, etc.). Bíonn siad páirteach i gcomhairleoireacht freisin

source: A psychiatrist usually works in a psychiatric hospital or unit or as part of a community care team but he or she can also be part of a private practice
ga: I bhformhór na gcásanna, oibríonn síciatraí in ospidéal síciatrach, in aonad síciatrach nó mar chuid d'fhoireann cúram phobail, ach is féidir leis/léi bheith fostaithe i gcleachtas príobháideach freisin

source: In most cases, your GP will refer you to a psychiatrist if he or she considers it necessary or if you request a referral
ga: Sa chuid is mó de na cásanna, atreoróidh do dhochtúir teaghlaigh chuig síciatraí má cheapann sé é a bheith riachtanach nó má iarrann tú é

source: A psychiatrist will assess the person, usually at a hospital out-patient clinic, form a diagnosis and treat the person accordingly
ga: Déanfaidh síciatraí measúnú ar an duine, i gclinic othar seachtrach in ospidéal de ghnáth, tiocfaidh sé ar dhiagnóis agus cuirfidh sé cóireáil ar an duine dá réir

source: This may involve treatment with medication or referral to a member of the mental health team
ga: Is é a d’fhéadfadh bheith i gceist leis an gcóireáil sin ná cógas a sholáthar nó an t-othar a atreorú chuig ball den fhoireann mheabhairshláinte

source: If a psychiatrist thinks it necessary, he or she may suggest that a patient be admitted to hospital
ga: Má cheapann an síciatraí é a bheith riachtanach, d'fhéadfadh sé/sí a mholadh go ligfear an t-othar isteach san ospidéal. De ghnáth, ní

source: This suggestion is generally only made if a person's difficulties are severe
ga: dhéantar an moladh sin ach amháin i gcásanna ina bhfuil deacrachtaí tromchúiseacha ag an duine

source: A psychologist is trained in the study of human behaviour and tries to explain feelings, thoughts and behaviour
ga: Is féidir le síceolaithe measúnú agus cóireáil de chineál síceolaíoch a chur ar fáil

source: Psychologists can provide assessment and treatment of a psychological nature that includes personality assessment through a structured interview, assessment of a wide range of psychological problems – anxiety, depression, self esteem issues, psycho-sexual and marital problems
ga: Is é a bhíonn i gceist leis sin ná measúnú pearsantachta a dhéanamh trí agallamh struchtúrtha agus measúnú a dhéanamh ar raon leathan fadhbanna síceolaíocha - imní, dúlagar, fadhbanna féinmheasa, fadhbanna sícighnéasacha agus fadhbanna pósta ina measc

source: They can also help patients examine the effects their illness is having on their lives and methods of coping with those effects
ga: Is féidir leo cabhrú le hothair freisin scrúdú a dhéanamh ar an tionchar a imríonn an tinneas ar a saol agus modhanna a mholadh dóibh chun dul i ngleic leis an tionchar sin

source: Bringing a patient closer to an understanding of his or her illness is a key aim of a psychologist
ga: Aidhm thábhachtach a bhíonn ag síceolaí is ea cabhrú leis an othar a t(h)inneas a thuiscint

source: When involved in the area of mental health, the psychologist usually works as a clinical, community or counselling psychologist, and unless also medically qualified, does not prescribe medication
ga: Agus é ag obair sa réimse meabhairshláinte, is minic a oibríonn an síceolaí mar shíceolaí cliniciúil, mar shíceolaí pobail nó mar shíceolaí comhairleoireachta

source: The clinical psychologist has a specialist qualification in mental health and works as part of the mental health team in a unit or hospital and is involved in assessment and counselling therapy
ga: Tá cáilíocht speisialtóra i meabhairshláinte ag síceolaí cliniciúil agus oibríonn sé mar chuid den fhoireann mheabhairshláinte in aonad nó in ospidéal. Pléann sé le measúnú agus le teiripe chomhairleoireachta

source: Family therapy may be provided where appropriate and a particular approach may be used for specific problems, such as a cognitive-behavioural approach for phobias
ga: Cuirtear teiripe theaghlaigh ar fáil nuair is cuí agus d’fhéadfadh go nglacfaí le cur chuige ar leith chun dul i ngleic le fadhbanna ar leith lena linn – mar shampla, glactar le cur chuige iompraíochta cognaíche i gcás fóibí

source: Referral is often through a GP or psychiatrist, but self-referral is possible
ga: Is trí dhochtúir teaghlaigh nó trí shíciatraí a atreoraítear othar chuig síceolaí cliniciúil de ghnáth, ach is féidir le duine é féin a atreorú freisin

source: The community psychologist has a clinical qualification and works as part of a community-based team with individuals such as social workers, speech therapists and community welfare officers
ga: Tá cáilíocht chliniciúil ag síceolaí pobail agus oibríonn sé mar chuid d'fhoireann phobalbhunaithe in éineacht le hoibrithe sóisialta, le teiripeoirí urlabhra agus le hoifigigh leasa pobail

source: The community psychologist is involved in assessing and working with those with a wide range of problems, including children with behavioural, educational and other difficulties
ga: Pléann síceolaí pobail le measúnú a dhéanamh orthu siúd a bhfuil raon leathan fadhbanna acu, lena n-áirítear leanaí a bhfuil deacrachtaí iompair, deacrachtaí oideachais agus deacrachtaí eile acu, agus le bheith ag obair leis na daoine sin

source: Counselling psychology, as a specialist area, encompasses a broad range of practices that help people improve their well being, alleviate distress and maladjustment, resolve crises, and increase their ability to live more highly functioning lives
ga: Cuimsíonn síceolaíocht chomhairleoireachta, mar limistéar speisialtóra, réimse fairsing de chleachtais a chabhraíonn le daoine feabhas a chur ar a bhfolláine, anacair agus mí-oiriúint a fhuascailt, géarchéimeanna a réiteach, agus a gcumas a mhéadú chun saol níos ardfheidhiúla a chaitheamh

source: Counselling psychologists can be found working in diverse areas such as schools and colleges, industrial workplaces and health services
ga: Is féidir teacht ar shíceolaithe comhairleoireachta ag oibriú i limistéir fhairsinge ar nós scoileanna agus coláistí, áiteanna oibre tionsclaíocha agus seirbhísí sláinte

source: Behavioural therapy works on the premise that you can change what people do by teaching them to respond to things in a different way
ga: Tá teiripe iompair bunaithe ar an teoiric gur féidir leat na nithe a dhéanann daoine a athrú trí mhúineadh dóibh conas freagairt do rudaí ar bhealach éagsúil

source: Behavioural therapy aims to help the patient control undesirable habits or irrational fears and can be used in the treatment of behavioural conditions like eating disorders and phobias
ga: Is é an aidhm atá le teiripe iompraíochta ná cabhrú leis an othar smacht a fháil ar ghnásanna neamh-inmhianaithe nó ar ábhair neamhréasúnacha eagla

source: In many cases, behaviours can be learned or unlearned through basic conditioning techniques
ga: Is féidir í a úsáid chun riochtaí iompraíochta ar nós neamhoird itheacháin agus fóibí a chóireáil

source: Behavioural therapy uses such techniques as aversive conditioning, where unwanted habits are paired with unpleasant stimuli, and systematic desensitisation, where a stimulus that causes anxiety is paired with a pleasant one
ga: I mórán cásanna, is féidir iompar a fhoghlaim nó a dhearmad trí leas a bhaint as bunteicnící riochtaithe. Baineann teiripe iompraíochta leas as riochtú dochmaitheach, rud trína ndéantar nasc idir gnásanna míthaitneamhacha, agus as dí-íogrú córasach, rud trína ndéantar nasc idir rud is cúis le himní agus rud taitneamhach

source: Some behavioural therapists may also be psychiatrists or psychologists but this is not necessarily the case
ga: Bíonn roinnt teiripeoirí iompraíochta ina síciatraithe nó ina síceolaithe, ach ní mar sin a bhíonn i gcónaí

source: They may be people like psychiatric nurses or social workers who have received the relevant training to work in this area
ga: D'fhéadfadh go mbeadh daoine eile ag obair sa réimse seo, ar nós altraí síciatracha nó oibrithe sóisialta atá tar éis oiliúint ábhartha a fháil ina leith. Cé go n-úsáidtear an cineál

source: While this kind of therapy is frequently used in the treatment of behaviour disorders, it may not be available in all regions
ga: sin teiripe go minic chun neamhoird iompraíochta a chóireáil, b'fhéidir nach mbeidh sé ar fáil i ngach réigiún

source: Cognitive behavioural therapy (CBT) aims to reduce dysfunctional emotions and behaviour by changing behaviour and thinking patterns
ga: Is é an aidhm atá le teiripe iompraíochta cognaíche (TIC) ná mothúcháin mhífheidhmiúla agus iompar mífheidhmiúil a laghdú trí phátrúin iompair agus smaointeoireachta a athrú

source: Professionals who specialise in this kind of therapy believe that a change in symptoms and behaviour follows a change in thinking
ga: Creideann gairmithe a dhéanann speisialtacht den chineál sin teiripe gur as athrú i smaointeoireacht a thagann athrú i siomtóim agus in iompar

source: This change can be brought about in a number of ways, including the practice of new behaviours and analysis of faulty thinking patterns
ga: Is féidir an t-athrú sin a dhéanamh ar roinnt bealaí éagsúla, lena n-áirítear cineálacha nua iompair a chleachtadh agus patrúin lochtacha smaointeoireachta a anailísiú

source: The purpose of CBT is to reduce distress or unwanted behaviour by undoing this learning or by providing new, more adaptive learning
ga: Is é cuspóir TIC ná anacair nó iompar gan iarraidh a laghdú tríd an bhfoghlaim sin a dhearmad nó trí fhoghlaim nua níos oiriúnaithí a chur ar fáil

source: Again, cognitive behavioural therapists may not all be psychologists or psychiatrists and you should check with your Health Service Executive (HSE) Area to see if the service is available in your area
ga: Mar an gcéanna, seans nach mbeidh gach teiripeoir iompraíochta cognaíche ina síceolaí ná ina síciatraí agus ba chóir duit teagmháil a dhéanamh le Limistéar áitiúil Fheidhmeannacht na Seirbhíse Sláinte (FSS) chun a fháil amach an bhfuil an tseirbhís ar fáil i do cheantar

source: There are many forms of counselling available for a wide range of problems and many counsellors specialise in particular areas such as addiction or bereavement
ga: Tá a lán cineálacha comhairleoireachta le fáil do raon leathan fadhbanna

source: All approaches emphasise non-judgemental, attentive listening and respect for the client
ga: Déanann mórán comhairleoirí speisialtacht de réimsí ar leith, mar shampla andúil nó bás

source: Counselling aims to enable people to take control of their own lives, and the counsellor may not adhere to one particular theory
ga: Leagtar béim i ngach cur chuige go n-éistear leis an gcliant ar bhealach aireach neamhbhreithiúnach agus go dtugtar meas dó

source: Self-referral is the usual route to counselling, although a GP, psychiatrist or trusted friend may be able to recommend someone suitable. Some counsellors are qualified psychologists, but many are not
ga: Is í an aidhm atá le comhairleoireacht ná deis a thabhairt do dhaoine smacht a fháil ar a saol féin, agus seans nach gcloífidh an comhairleoir le teoiric ar leith amháin

source: Those who are not may have a basic degree or training in other areas and/or relevant work experience (for example, teaching, nursing, etc.) plus a counselling qualification
ga: Is é féin-atreorú an gnáthbhealach a leantar chun dul i mbun comhairleoireachta, cé gur féidir le dochtúir teaghlaigh, le síciatraí nó le dlúthchara bheith in ann duine oiriúnach a mholadh

source: These qualifications can vary from Masters degrees to short-term courses
ga: Tá roinnt comhairleoirí ina síceolaithe cáilithe, ach ní hamhlaidh atá an scéal i gcás cuid mhór acu

source: It is important to make sure you are happy with the training and qualifications of any counsellor that you choose
ga: I gcás na ndaoine siúd nach síceolaithe cáilithe iad, seans go ndearna siad bunchéim nó bunoiliúint i réimsí eile agus/nó go bhfuil taithí oibre ábhartha acu (e.g., teagasc, altranas), in éineacht le cáilíocht chomhairleoireachta

source: Counselling is often one session per week and tends to be short-term rather
ga: Bíonn idir chéimeanna Máistreachta agus

source: than longer-term, although this can vary
ga: chúrsaí gearrthéarmacha i gceist anseo

source: Addiction counsellors provide assessment, counselling, information and treatment services for people suffering from alcohol, drugs and gambling addictions
ga: Cuireann comhairleoirí andúile seirbhísí measúnaithe, comhairle, faisnéise agus cóireála ar fáil do dhaoine atá ag fulaingt andúile san alcól, i ndrugaí nó i gcearrbhachas

source: Before receiving counselling for addiction, a patient must go through a detoxification programme, if necessary
ga: Sula bhfaigheann sé comhairleoireacht le haghaidh andúile, ní mór d’othar clár díthocsainithe a chur i gcrích, más cuí

source: The patient is then referred to the community-based addiction treatment service
ga: Déantar an t-othar a atreorú ansin chuig seirbhís phobalbhunaithe um chóireáil andúile

source: An individual and group counselling approach is commonly used with an emphasis on the consequences of the addict's behaviour
ga: Is é an cur chuige is coitianta ná comhairleoireacht a dhéanamh duine le duine nó i ngrúpaí agus leagtar béim ar iarmhairtí iompar an andúiligh lena linn

source: The main aspect of treatment examines the triggering factors that lead to the development of the addiction
ga: Féachann an phríomhghné den chóireáil ar na tosca a bhí ina gcúis le forbairt na handúile

source: Target goals are set to try and establish new patterns of healthy behaviour
ga: Leagtar spriocanna síos chun iarracht a dhéanamh pátrúin shláintiúla iompair a bhunú

source: An important part of the treatment is the involvement of a family member, which can help to achieve these targets
ga: Cuid an-tábhachtach den chóireáil is ea rannpháirtíocht a fháil ó dhuine de theaghlach an andúiligh, rud a chabhraíonn leis na spriocanna sin a bhaint amach

source: The programme lasts for an average of six to eight weeks and is followed by an after care service
ga: Ar an meán, maireann an clár idir sé seachtaine agus ocht seachtaine. Cuirtear seirbhís iarchúraim ar fáil ina dhiaidh sin

source: Psychotherapy tends to be more in-depth than counselling
ga: Is minic a bhíonn síciteiripe níos doimhne ná comhairleoireacht

source: It is based on the idea that the less aware we are of our motives, feelings and actions, the more they control us and the more we stay stuck in old patterns that may be harmful to us
ga: Tá sí bunaithe ar na smaointe seo a leanas: dá laghad eolas atá againn ar ár gceannfháthanna, ar ár mothúcháin agus ar ár ngníomhartha, is é is mó an tionchar a imríonn siad orainn; agus dá fhaide a leanaimid seanphatrúin, is é is mó dochar a dhéanfaidh siad dúinn

source: A psychotherapist can help patients to examine their subconscious mind
ga: Is féidir le síciteiripeoir cabhrú le hothair a n-aigne fho-chomhfhiosach a scrúdú

source: By bringing any unconscious motives, fears and feelings to light and dealing with them, patients can often get relief from their symptoms
ga: Trí aon cheannfháthanna, aon ábhair eagla agus aon mhothúcháin a thabhairt chun solais, agus trí iad sin a shárú, is féidir le hothair sólás a fháil óna gcuid siomtóim i mórán cásanna

source: Psychotherapists usually undertake a long postgraduate training that requires trainees to undergo therapy, often twice per week, for several years
ga: De ghnáth, tugann síciteiripeoirí faoi oiliúint fhada iarchéime, rud ina n-éilítear ar oiliúnaithe dul faoi theiripe - dhá uair in aghaidh na seachtaine i mórán cásanna - ar feadh roinnt blianta

source: The techniques and interventions used by the psychotherapist vary according to the theoretical framework within which he or she is working
ga: Is ar an gcreat teoiriciúil ina mbíonn sé nó sí ag obair a bhíonn na teicnící agus idirghabhálacha a úsáideann an síciteiripeoir ag brath

source: The psychiatric nurse plays a central role in the care of the psychiatric patient, both in a hospital setting and in the community
ga: Imríonn altra síciatrach ról tábhachtach i gcúram an othair shíciatraigh, san ospidéal agus sa phobal araon

source: He or she works within a psychiatric service as part of a health care team
ga: Is idir chúram fisiciúil agus chúram síceolaíoch a chuireann altraí ar fáil dá n-othar

source: Nurses provide both physical and psychological care to their patients and can also provide essential support and encouragement to the patients' families
ga: Uaireanta, tugann siad tacaíocht agus spreagadh riachtanach do theaghlaigh na n-othar freisin

source: The nurse's activities are varied but can include:
ga: Is éagsúil a bhíonn cúraimí an altra, ach bíonn na nithe seo a leanas i gceist leo:

source: • Education of student nurses and community groups
ga: • Oideachas a chur ar altraí faoi oiliúint agus ar ghrúpaí pobail

source: • Family education and support
ga: • Oideachas a chur ar theaghlaigh agus tacaíocht a thabhairt dóibh

source: • Group therapies, individual counselling
ga: • Grúptheiripe, comhairleoireacht duine le duine

source: • Acting as a liaison with in-patient services, GPs, strategy and voluntary organisations
ga: • Idirchaidreamh a dhéanamh le seirbhísí othar cónaithe, le dochtúirí teaghlaigh, le heagraíochtaí straitéise agus le heagraíochtaí deonacha

source: • Organisation of admissions to hospital and reception
ga: • Ligean isteach san ospidéal agus glacadh le hothair a eagrú

source: • Initial assessment of referrals from GPs
ga: • Measúnú tosaigh a dhéanamh ar atreoruithe ó dhochtúirí teaghlaigh

source: The community psychiatric nurse usually follows up patients on discharge from hospital, calling to their homes and attending out-patients' clinics and day care centres
ga: De ghnáth, déanann an t-altra síciatrach pobail teagmháil le hothair tar éis iad a scaoileadh ón ospidéal, é ag tabhairt cuairt ar a dtithe agus ag freastal ar chlinicí othar seachtrach agus ar ionaid chúram lae

source: Community psychiatric nurses are now becoming involved in patients' rehousing needs
ga: Bíonn altraí síciatracha pobail ag éirí páirteach anois i riachtanais athchóiríochta othar

source: Mental health social workers carry out a range of functions as members of a multi-disciplinary team
ga: Cuireann oibrithe sóisialta meabhairshláinte raon feidhmeanna éagsúla i gcrích mar chuid d’fhoireann ildisciplíneach

source: Individual counselling is one of their key tasks in assisting those with a variety of emotional difficulties
ga: Tá comhairleoireacht duine le duine ar cheann de na príomhchúraimí atá orthu maidir le cúnamh a thabhairt do dhaoine a bhfuil cineálacha éagsúla deacrachtaí mothúchánacha acu

source: Another key function is 'psycho-education'
ga: Feidhm thábhachtach eile is ea ‘síocoideachas’

source: Psycho-education refers to work with individuals and their families to explain aspects of the mental illness
ga: Tagraíonn síocoideachas don obair a dhéantar le daoine aonair agus lena dteaghlach chun gnéithe de mheabhairghalar a mhíniú dóibh

source: Psycho-education also involves offering coping strategies appropriate to the specific mental illness
ga: Is é atá i gceist le síocoideachas freisin ná straitéisí déileála atá oiriúnach don mheabhairghalar lena mbaineann a chur ar fáil

source: Given that mental health service provision is sometimes fragmented, mental health social workers are committed to 'case management' or 'care management'
ga: Tagraíonn sé sin do bheith ag obair le daoine ar mhaithe le comhleanúnachas cúraim agus comhordú seirbhísí a chinntiú

source: This refers to working with individuals with a view to ensuring continuity of care and the co-ordination of services
ga: Cabhraíonn sé sin lena bhfolláine agus le caighdeán a mbeatha a uasmhéadú

source: This helps to maximise their wellbeing and quality of life
ga: Is é atá i gceist le bainistíocht cáis ná

source: Case management involves the integration of health services with a range of other services
ga: seirbhísí sláinte a chomhtháthú le raon seirbhísí eile

source: Examples include, housing, social welfare, job training and employment, liaison with statutory and voluntary agenices, etc
ga: I measc samplaí de na seirbhísí sin, tá tithíocht, leas sóisialach, oiliúint poist agus fostaíocht, idirchaidreamh le gníomhaireachtaí reachtúla agus deonacha, etc

source: All of these links may contribute to positive mental health
ga: D’fhéadfadh gach ceann de na naisc sin cur le meabhairshláinte dhearfach

source: Occupational therapists provide services to people whose ability to cope with everyday activities is threatened or impaired in some way by physical, psychological or developmental problems
ga: Cuireann teiripeoirí saothair seirbhísí ar fáil do dhaoine a bhfuil a gcumas chun déileáil le gníomhaíochtaí laethúla faoi bhagairt nó faoi lagú ar shlí éigin ag fadhbanna fisiciúla, síceolaíocha nó forbartha

source: Occupational therapists can assess and treat anyone (adult or child) who has practical difficulties due to mental illness, accidental injury, arthritis, cerebral palsy, learning difficulties, stroke, and other congenital, developmental, degenerative or neurological conditions
ga: Is féidir le teiripeoirí saothair measúnú agus cóireáil a dhéanamh ar dhuine ar bith (duine fásta nó leanbh) a bhfuil deacrachtaí praiticiúla aige de bharr meabhairghalair, gortú timpisteach, airtrítis, pairilis cheirbreach, deacrachtaí foghlama, stróc nó de bharr riochtaí eile comhbheirthe, forbartha, meathlúcháin nó néareolaíocha
